ProgessBase/DataProcessors/УЗ_КвитанцияОПриемеМолока.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>УЗ_КвитанцияОПриемеМолока</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКвитанции</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Накладные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПоступлениеТоваров</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

ProgessBase/Catalogs/СерииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>СерииНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокГодности</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерГТД</Name>
					<Comment>(Регл) Номер ГТД по умолчанию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаПроисхождения</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеИзображение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищеДополнительнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УЗ_ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УЗ_Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УЗ_Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УЗ_АМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УЗ_ПроцентСухихВеществ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УЗ_Кислотность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УЗ_ТемператураХранения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УЗ_ДатаВыработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДизайна</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УЗ_КоличествоТарныхМест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПРГ_Влажность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПРГ_Плотность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПРГ_pH</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПРГ_Скидка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НСИ_МДЖ</Name>
					<Comment>% содержания жира</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НСИ_МДБ</Name>
					<Comment>% содержания белка</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НСИ_МДЖ_ТТН</Name>
					<Comment>% содержания жира по ТТН</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НСИ_МДБ_ТТН</Name>
					<Comment>% содержания белка по ТТН</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НСИ_МДСВ_ТТН</Name>
					<Comment>% содержания сухих веществ по ТТН</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УЗ_Накладная</Name>
					<Comment>Ссылка на документ поступления</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УЗ_Секция</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ProgessBase/DataProcessors/УЗ_КвитанцияОПриемеМолока/Ext/ObjectModule.bsl
Процедура ПечатьКвитанции() Экспорт
	
	мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_КвитанцияПриемаМолока";
	
	Макет = ПолучитьМакет("Макет");
	
	//Выведем шапку
	ОбластьПечати = Макет.ПолучитьОбласть("Шапка");
	ОбластьПечати.Параметры.Организация = СокрЛП(Организация.НаименованиеПолное);
	ОбластьПечати.Параметры.КодОрганизации = СокрЛП(Организация.Код);
	ОбластьПечати.Параметры.ГородОрганизация = "г. Липецк";	
	
	ОбластьПечати.Параметры.Поставщик = СокрЛП(Поставщик.НаименованиеПолное);
	ОбластьПечати.Параметры.КодПоставщика = СокрЛП(Поставщик.Код);
	ОбластьПечати.Параметры.ГородПоставщика = "";	
	
	ОбластьПечати.Параметры.ГодКвитанции = Формат(Год(ДатаКвитанции),"ЧГ=0");
	ОбластьПечати.Параметры.МесяцКвитанции = Месяц(ДатаКвитанции);
	ОбластьПечати.Параметры.ДеньКвитанции = День(ДатаКвитанции);
	  	
	ТабДокумент.Вывести(ОбластьПечати);
	
	//Выведем строки
	
	ТабНДС = Новый ТаблицаЗначений;
	ТабНДС.Колонки.Добавить("СтавкаНДС");
	ТабНДС.Колонки.Добавить("СуммаНДС");
	
	ОбластьПечати = Макет.ПолучитьОбласть("Строка");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПоступлениеТоваровУслугТовары.Ссылка.Дата КАК Дата,
	               |	ПоступлениеТоваровУслугТовары.Номенклатура КАК Продукт,
	               |	ПоступлениеТоваровУслугТовары.Количество*ПоступлениеТоваровУслугТовары.Коэффициент КАК Количество,
	               |	ПоступлениеТоваровУслугТовары.Коэффициент,
	               |	ПоступлениеТоваровУслугТовары.ЕдиницаИзмерения,
	               |	ПоступлениеТоваровУслугТовары.Цена КАК Цена,
	               |	ПоступлениеТоваровУслугТовары.Сумма КАК Сумма,
	               |	ПоступлениеТоваровУслугТовары.СтавкаНДС КАК СтавкаНДС,
	               |	ПоступлениеТоваровУслугТовары.СуммаНДС КАК СуммаНДС,
	               |	ПоступлениеТоваровУслугТовары.Ссылка.ВалютаДокумента,
	               |	ПоступлениеТоваровУслугТовары.Ссылка.КратностьВзаиморасчетов,
	               |	ПоступлениеТоваровУслугТовары.Ссылка.КурсВзаиморасчетов,
	               |	ЕСТЬNULL(СерииНоменклатуры.НСИ_МДЖ, 0) КАК Жир,
	               |	ЕСТЬNULL(СерииНоменклатуры.НСИ_МДБ, 0) КАК Белок,
	               |	ПоступлениеТоваровУслугТовары.Ссылка
	               |ИЗ
	               |	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	               |		ПО ПоступлениеТоваровУслугТовары.СерияНоменклатуры = СерииНоменклатуры.Ссылка
	               |ГДЕ
	               |	ПоступлениеТоваровУслугТовары.Ссылка В(&СПНакладные)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата";
	
	Запрос.УстановитьПараметр("СПНакладные", Накладные.ВыгрузитьКолонку("ПоступлениеТоваров"));
	
	ИтогоСуммаСНДС = 0;
	ИтогоКоличество = 0;
	НомерПП = 0;
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		
		НомерПП = НомерПП + 1;
		
		ОбластьПечати.Параметры.НомерПП = НомерПП;
		ОбластьПечати.Параметры.Заполнить(Результат);
		
		ОбластьПечати.Параметры.Продукт = СокрЛП(Результат.Продукт.Код) + " " + СокрЛП(Результат.Продукт);
		
		Сумма = Результат.Сумма;
		СуммаНДС = Результат.СуммаНДС;
		Если НЕ Результат.Ссылка.СуммаВключаетНДС Тогда
			Сумма = Сумма + СуммаНДС;
		КонецЕсли;
		Цена = Окр(Результат.Сумма/Результат.Количество,2);
		
		ОбластьПечати.Параметры.Сумма = Сумма;
		ОбластьПечати.Параметры.Цена  = Цена;
		
		ТабДокумент.Вывести(ОбластьПечати);	
		
		СтрокаНДС = ТабНДС.Добавить();
		СтрокаНДС.СтавкаНДС = Результат.СтавкаНДС;
		СтрокаНДС.СуммаНДС  = СуммаНДС;
		
		ИтогоСуммаСНДС = ИтогоСуммаСНДС + Сумма;
		ИтогоКоличество = ИтогоКоличество + Результат.Количество;
		
		Если Результат.Дата < ДатаНачала Тогда
			ДатаНачала = Результат.Дата;
		ИначеЕсли Результат.Дата > ДатаОкончания Тогда
			ДатаОкончания = Результат.Дата;
		КонецЕсли;  		
		
	КонецЦикла;
	
	ТабНДС.Свернуть("СтавкаНДС", "СуммаНДС");
	
	//Выведем итого
	ОбластьПечати = Макет.ПолучитьОбласть("Итого");
	
	ОбластьПечати.Параметры.Количество = ИтогоКоличество;
	ОбластьПечати.Параметры.Сумма = ИтогоСуммаСНДС;
	
	ТабДокумент.Вывести(ОбластьПечати);
	
	СуммаПрописью = ОбщегоНазначения.СформироватьСуммуПрописью(ИтогоСуммаСНДС, мВалютаРегламентированногоУчета);
		
	//Выведем подвал
	ОбластьПечати = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьПечати.Параметры.ПериодПоставки = " с " + Формат(ДатаНачала,"ДФ=dd.MM.yyyy") + " по " + Формат(ДатаОкончания,"ДФ=dd.MM.yyyy");
	ОбластьПечати.Параметры.СуммаПрописью = СуммаПрописью;
	ОбластьПечати.Параметры.Сумма = ИтогоСуммаСНДС;
	//ОбластьПечати.Параметры.СуммаНДС = ТабНДС.Итог("СуммаНДС");
	
	ТабДокумент.Вывести(ОбластьПечати);
	
	//Выведем таб НДС
	
	ОбластьПечати = Макет.ПолучитьОбласть("НДС");
	Для каждого СтрокаНДС Из ТабНДС Цикл
	
		ОбластьПечати.Параметры.СуммаНДСПрописью = СокрЛП(СтрокаНДС.СтавкаНДС) + " " + ОбщегоНазначения.СформироватьСуммуПрописью(СтрокаНДС.СуммаНДС, мВалютаРегламентированногоУчета);
		ОбластьПечати.Параметры.СуммаНДС = СтрокаНДС.СуммаНДС;
		ТабДокумент.Вывести(ОбластьПечати);
	КонецЦикла; 	
	
	//Выведем подписи
	ОбластьПечати = Макет.ПолучитьОбласть("Подписи");
	ОбластьПечати.Параметры.СуммаПрописью = СуммаПрописью;
	ТабДокумент.Вывести(ОбластьПечати);
	
	ТабДокумент.АвтоМасштаб			 = Истина;
	ТабДокумент.ОриентацияСтраницы	 = ОриентацияСтраницы.Портрет;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, 1, Ложь, "Печать квитанции о приеме молока");
	
КонецПроцедуры
